title: Legacy Interactive Profile
description: Specifies an MDMv1 profile to present to the user who may choose to download
  and install it
payload:
  declarationtype: com.apple.configuration.legacy.interactive
  supportedOS:
    iOS:
      introduced: '15.0'
    macOS:
      introduced: '13.0'
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: ProfileURL
  title: Profile's URL.
  type: <string>
  presence: required
  content: |-
    The URL of the profile to download and install. This must be an 'https://' URL. The system silently ignores any account or passcode payloads in the profile. Use their declarative configurations instead.
    If a user enrollment triggers this configuration, the system silently ignores any MDM 1 payloads in macOS where the User Enrollment Mode setting is 'forbidden'. In iOS, the system rejects the entire profile.
- key: VisibleName
  title: Configuration Visible Name
  type: <string>
  presence: required
  content: The visible name of the configuration. This name needs to indicate the
    nature of the profile.
