title: Status Device UDID
description: The device's UDID.
payload:
  statusitemtype: device.identifier.udid
  supportedOS:
    iOS:
      introduced: '16.0'
      userenrollment:
        mode: forbidden
    macOS:
      introduced: '13.0'
      userenrollment:
        mode: forbidden
    tvOS:
      introduced: '16.0'
payloadkeys:
- key: device.identifier.udid
  title: Status item value.
  type: <string>
  presence: required
  content: Status value.
