title: Status Passcode Is Present
description: Whether a passcode is present ot not.
payload:
  statusitemtype: passcode.is-present
  supportedOS:
    iOS:
      introduced: '16.0'
    macOS:
      introduced: n/a
    tvOS:
      introduced: n/a
payloadkeys:
- key: passcode.is-present
  title: Status item value.
  type: <boolean>
  presence: required
  content: Status value.
